In [5]:

import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

ModuleNotFoundError: No module named 'seaborn'

In [9]:

print("Are there any missing values?", df.isnull().values.any())

Are there any missing values? True

In [7]:
df = pd.read_csv("acdemic_data.csv")

In [10]:
df.head(5)

  Firstname Lastname Gender  SPOS DSBDA     WT  DA
0        LA      Roy      M  85.0    88   90.0  92
1        jh    singh      M  53.0    58   64.0  80
2        SA    Dixit      F  90.0    90   94.0  95
3        AB   Danial      M   NaN    na  100.0  80
4        DA   Kapoor      M  95.0    86  500.0  82

In [11]:
missing_value_formats = ["n.a.","?","NA","n/a", "na", "--"]
df = pd.read_csv("acdemic_data.csv", na_values = missing_value_formats)

In [12]:
df['Gender'].head(10)

0    M
1    M
2    F
3    M
4    M
5    F
6    F
7    M
8    F
9    M
Name: Gender, dtype: object

In [13]:
df['Gender'].notnull().head(15)

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
Name: Gender, dtype: bool

In [14]:
null_filter = df['Gender'].notnull()

In [15]:
df[null_filter]

   Firstname Lastname Gender   SPOS  DSBDA     WT   DA
0         LA      Roy      M   85.0   88.0   90.0   92
1         jh    singh      M   53.0   58.0   64.0   80
2         SA    Dixit      F   90.0   90.0   94.0   95
3         AB   Danial      M    NaN    NaN  100.0   80
4         DA   Kapoor      M   95.0   86.0  500.0   82
5         SA      Jha      F    NaN   84.0   98.0   84
6         WS   Thakur      F   87.0    NaN   97.0   86
7         DY   Kapoor      M   81.0   80.0   96.0   89
8         JK   Khanna      F   40.0   88.0   95.0   87
9         RT  Pardesi      M   10.0   96.0   94.0   88
10        UV  Pardesi      M    9.0    NaN   93.0   96
11        MN    Desai      F  200.0   87.0    NaN  N.A
12        BC    Patel      F  300.0    NaN   88.0  300

In [16]:
df.isnull().sum()

Firstname    0
Lastname     0
Gender       0
SPOS         2
DSBDA        4
WT           1
DA           0
dtype: int64

In [17]:
df.dropna(axis=0,inplace=True)

In [18]:
df['SPOS'].head(10)

0    85.0
1    53.0
2    90.0
4    95.0
7    81.0
8    40.0
9    10.0
Name: SPOS, dtype: float64

In [19]:
df.head(5) 
df.tail(5)

  Firstname Lastname Gender  SPOS  DSBDA     WT  DA
2        SA    Dixit      F  90.0   90.0   94.0  95
4        DA   Kapoor      M  95.0   86.0  500.0  82
7        DY   Kapoor      M  81.0   80.0   96.0  89
8        JK   Khanna      F  40.0   88.0   95.0  87
9        RT  Pardesi      M  10.0   96.0   94.0  88

In [20]:
null_filter = df['Gender'].notnull()

df[null_filter]

In [21]:
print(df[null_filter])

  Firstname Lastname Gender  SPOS  DSBDA     WT  DA
0        LA      Roy      M  85.0   88.0   90.0  92
1        jh    singh      M  53.0   58.0   64.0  80
2        SA    Dixit      F  90.0   90.0   94.0  95
4        DA   Kapoor      M  95.0   86.0  500.0  82
7        DY   Kapoor      M  81.0   80.0   96.0  89
8        JK   Khanna      F  40.0   88.0   95.0  87
9        RT  Pardesi      M  10.0   96.0   94.0  88

In [22]:
print(df.isnull().values.any())

False

In [23]:
print(df.isnull().sum())

Firstname    0
Lastname     0
Gender       0
SPOS         0
DSBDA        0
WT           0
DA           0
dtype: int64

In [24]:
df.dropna(axis=0,inplace=True)

In [25]:
new_df = df.dropna(axis = 0, how ='any')

In [26]:
new_df = df.dropna(axis = 0, how ='all')

In [27]:
new_df = df.dropna(axis = 1, how ='any')

In [28]:
new_df = df.dropna(axis = 1, how ='all')

In [29]:
df['SPOS'].fillna(0, inplace=True)

C:\Users\singh\AppData\Local\Temp\ipykernel_16092\337399362.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['SPOS'].fillna(0, inplace=True)

In [30]:
print(df['SPOS'].head(10))

0    85.0
1    53.0
2    90.0
4    95.0
7    81.0
8    40.0
9    10.0
Name: SPOS, dtype: float64

In [31]:
df['SPOS'].fillna(method='bfill', inplace=True) 
print(df['SPOS'].head(10))

0    85.0
1    53.0
2    90.0
4    95.0
7    81.0
8    40.0
9    10.0
Name: SPOS, dtype: float64

C:\Users\singh\AppData\Local\Temp\ipykernel_16092\716566806.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['SPOS'].fillna(method='bfill', inplace=True)
C:\Users\singh\AppData\Local\Temp\ipykernel_16092\716566806.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['SPOS'].fillna(method='bfill', inplace=True)

In [32]:
df['DSBDA'].fillna(method='pad', inplace=True)
print(df['DSBDA'].head(10))

0    88.0
1    58.0
2    90.0
4    86.0
7    80.0
8    88.0
9    96.0
Name: DSBDA, dtype: float64

C:\Users\singh\AppData\Local\Temp\ipykernel_16092\2837439953.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['DSBDA'].fillna(method='pad', inplace=True)
C:\Users\singh\AppData\Local\Temp\ipykernel_16092\2837439953.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['DSBDA'].fillna(method='pad', inplace=True)

In [33]:
df.shape

(7, 7)

In [34]:
plt.boxplot(x=df['SPOS'])

NameError: name 'plt' is not defined